package lab4;

/**
 * Задание: "Компьютерная иерархия"
 *
 * Структура задания:
 * 1. Создай базовый класс Component с полями: model, manufacturer и price. Это будут основные параметры для каждого компонента компьютера. Также необходимо добавить геттеры и сеттеры для каждого поля.
 * 2. Создай подклассы, которые отражают различные компоненты компьютера, такие как CPU, RAM, HardDrive, GraphicCard, Monitor и так далее.
 * 3. Добавь в каждый из подклассов требуемые дополнительные поля. Например, для CPU это может быть количество ядер, для RAM - емкость, для HardDrive - тип накопителя (SSD или HDD), для GraphicCard - GDDR и объем и т.д.
 * 4. Плюс, можно в каждый подкласс включить уникальные методы. Например, для подкласса RAM можно добавить метод overclock (разгон) включающий изменение частоты.
 * 5. Создай класс Computer, в котором будут объекты всех вышеупомянутых классов и методы для вывода информации о каждом компоненте.
 * */
public class Computer {
}
